OpenFOAM/foam9tutorials/interfluo/OpenFOAM-Wing-Mesh-Refinement-Study-main/OpenFOAM-Wing-Mesh-Refinement-Study-main/Mesh_Refinement/case4/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.0;

vertices
(
    ( 0.25 -1.0 -5)
    ( 0.75 -1.0 -5)
    ( 0.75 1.25 -5)
    ( 0.25 1.25 -5)
    ( 0.25 -1.0 3)
    ( 0.75 -1.0 3)
    ( 0.75 1.25 3)
    ( 0.25 1.25 3)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (8 36 128) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
		inlet
        {
            type patch;
            faces
            (
                (4 5 6 7)
            );
        }
		
		outlet
        {
            type patch;
            faces
            (
                (0 3 2 1)
            );
        }
		
		side
        {
            type wall;
            faces
            (
                (0 4 7 3)
				(1 2 6 5)
				(0 1 5 4)
				(3 7 6 2)
            );
        }
);

// ************************************************************************* //
